---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.Coordinates
source: html/41d7e690-a9b4-2ff0-71c5-98d7f4877cfb.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.Coordinates Property

Options which specifies the coordinates of Navisworks Exporter.
 Default value is Shared.

## Syntax (C#)
```csharp
public NavisworksCoordinates Coordinates { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration